app/controllers/convenios_controller.rb

  def index
    @convenios = Convenio.all
---
SELECT "convenios".* FROM "convenios"