app/controllers/dashboard_controller.rb

SELECT  "users".* FROM "users"  WHERE "users"."id" = 2  ORDER BY "users"."id" ASC LIMIT 1
UPDATE "users" SET "first_name" = $1, "last_name" = $2, "role" = $3, "updated_at" = $4, "username" = $5 WHERE "users"."id" = 2  [["first_name", "aaa"], ["last_name", "aaaaaaa"], ["role", "aaaa"], ["updated_at", "2015-04-16 21:03:45.458336"], ["username", "aaaa"]]
---
  def add_fields_user
  	@current_user = User.where(id: current_user.id).first
  	@current_user.update_attributes(
  		first_name: params[:first_name],
  		last_name: params[:last_name],
  		username: params[:username],
  		role: params[:role]
  	)