app/controllers/home_controller.rb

	def check_user_admin
		@user = User.where(email: params[:email_admin]).first
		if @user.present? && @user.role == "Administracion" && @user.pass_admin == params[:pass]
---
SELECT  "users".* FROM "users"  WHERE "users"."email" = 'manuperez0993@gmail.com'  ORDER BY "users"."id" ASC LIMIT 1
SELECT "users".* FROM "users"

	def show_specialities
		@specialities = Speciality.all
---
SELECT "specialities".* FROM "specialities"