app/controllers/pacientes_controller.rb

INSERT INTO "pacientes" ("created_at", "direccion", "documento", "estado", "genero", "nacimiento", "num_ficha_sisben", "pri_apellido", "pri_nombre", "regimen", "seg_apellido", "seg_nombre", "telefono", "tipo_documento", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15) RETURNING "id"
---
  def create
    @paciente = Paciente.new(paciente_params)
    @paciente.save

UPDATE "pacientes" SET "direccion" = $1, "documento" = $2, "estado" = $3, "genero" = $4, "num_ficha_sisben" = $5, "pri_apellido" = $6, "pri_nombre" = $7, "regimen" = $8, "seg_apellido" = $9, "seg_nombre" = $10, "telefono" = $11, "tipo_documento" = $12, "updated_at" = $13 WHERE "pacientes"."id" = 1
---
  def update
    @paciente.update(paciente_params)

SELECT  "pacientes".* FROM "pacientes"  WHERE "pacientes"."id" = $1 LIMIT 1  [["id", 2]]
---
    def set_paciente
      @paciente = Paciente.find(params[:id])