app/controllers/servicios_controller.rb

SELECT "servicios".* FROM "servicios"
---
  def index
    @servicios = Servicio.all

INSERT INTO "servicios" ("created_at", "descripcion", "estado", "nombre", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", "2015-05-10 13:16:34.787291"], ["descripcion", "3232233223"], ["estado", "32233232"], ["nombre", "23232322323"], ["updated_at", "2015-05-10 13:16:34.787291"]]
---
  def create
    @servicio = Servicio.new(servicio_params)
    @servicio.save

SELECT  "servicios".* FROM "servicios"  WHERE "servicios"."id" = $1 LIMIT 1  [["id", 1]]
---
    def set_servicio
      @servicio = Servicio.find(params[:id])