app/controllers/specialities_controller.rb

  def index
    @specialities = Speciality.all
---
SELECT "specialities".* FROM "specialities"

  def create
    @speciality = Speciality.new(speciality_params)
    @speciality.save
---
INSERT INTO "specialities" ("created_at", "descripcion", "name", "status", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", "2015-05-10 15:03:05.955588"], ["descripcion", "ededede"], ["name", "eewdee"], ["status", "eewewew"], ["updated_at", "2015-05-10 15:03:05.955588"]]

    def set_speciality
      @speciality = Speciality.find(params[:id])
---
SELECT  "specialities".* FROM "specialities"  WHERE "specialities"."id" = $1 LIMIT 1  [["id", 4]]